{
  "PERSONALITY_DYNAMICS": {
    "statements": [
      "I generally have a positive mood.",
      "I am good at managing my emotions.",
      "I don't struggle to cope with stressful situations.",
      "I can cope with emotional challenges.",
      "I am flexible in the face of potentially stressful situations.",
      "My anxiety levels are generally low.",
      "I can motivate myself positively.",
      "I am good at understanding other people's emotions.",
      "I notice the needs of people close to me.",
      "I respect the thoughts of others.",
      "I can understand the emotions behind what people say.",
      "My strong understanding of others' feelings contributes to my social relationships.",
      "I can understand the meaning of the pain that others feel.",
      "I can read people's emotions from their body language.",
      "Being open to new experiences excites me.",
      "I am open to listening to different ideas.",
      "Meeting people from different cultures makes me happy.",
      "I enjoy collaborating and working with different people.",
      "I have the courage to try new things in life.",
      "I am good at adapting to change.",
      "I am a confident person.",
      "I don't hesitate to express my thoughts.",
      "I don't hesitate to take initiative.",
      "Those who know me well say I am confident.",
      "I can have open and clear communication with my partner in our relationship.",
      "I feel safe and comfortable when I'm with my partner.",
      "I respect my partner's boundaries.",
      "I can express my feelings openly to my partner.",
      "I try to understand my partner's feelings and needs.",
      "I make an effort to strengthen trust and commitment in our relationship.",
      "I share responsibilities in our relationship.",
      "I express my trust in my partner sincerely.",
      "When we have issues, I use a constructive language with my partner.",
      "I make an effort to create a loving atmosphere in our relationship.",
      "I try to support my partner."
    ]
  },
  "FAMILY_DYNAMICS": {
    "statements": [
      "I enjoy spending time with my family.",
      "My family accepts me for who I am.",
      "My family respects the decisions I make in my life.",
      "My family is there for me when I need them.",
      "I feel emotionally close to my family.",
      "I feel safe when I'm with my family.",
      "We have good memories together as a family.",
      "Everyone in my family is respectful towards each other.",
      "My family respects my decisions regarding religious matters.",
      "My family respects my decisions regarding work and career matters.",
      "My parents get along well in their marriage.",
      "My parents are sensitive to each other's feelings.",
      "My parents successfully resolve conflicts when they have disagreements.",
      "My parents enjoy spending time together.",
      "My parents make decisions regarding our family together.",
      "My parents value each other's opinions.",
      "My parents manage our family budget well.",
      "My parents feel happy when they are with each other.",
      "My parents are in harmony regarding housework.",
      "My parents can solve their problems through communication.",
      "My parents respect each other's personal space.",
      "My parents share responsibilities related to our family.",
      "I discuss issues related to my family with my partner.",
      "I am open and clear with my partner when we discuss matters related to our families.",
      "I express my expectations regarding our families to my partner clearly.",
      "I believe that my partner has a good relationship with my family.",
      "I cannot cooperate with my partner to resolve issues related to our families.",
      "My partner and I determine our boundaries regarding our families together.",
      "I express my feelings regarding our families clearly to my partner.",
      "I respect cultural differences between our families.",
      "I am open to my partner regarding our family history.",
      "I share my problems with my partner regarding my family."
    ]
  },
  "COUPLE_RELATIONSHIP_DYNAMICS": {
    "statements": [
      "I want to have open and honest communication with my partner.",
      "I want to preserve our relationships with family and friends together with my partner.",
      "I want to resolve disagreements with my partner through cooperation.",
      "I want our sexual life to be based on open communication and mutual respect.",
      "I want us to support each other in our work and careers.",
      "I want to share and do household chores together with my partner.",
      "I want to feel that we belong to each other.",
      "I want my partner to respect the time I set aside for myself.",
      "I want to plan our vacations together with my partner.",
      "I emphasize the importance of mutual respect and understanding in our relationship.",
      "I want my partner to actively listen to me in our marriage.",
      "I emphasize the importance of setting common goals with my partner in our marriage.",
      "I want to maintain our sense of trust in our marriage.",
      "I want my partner to be loyal in our marriage.",
      "I want to share child-rearing responsibilities with my partner.",
      "I want there to be an equal balance of power in our relationship.",
      "I expect both of us to make equal sacrifices in terms of work and career.",
      "I listen to my partner carefully.",
      "I make sure my partner can express their thoughts during communication.",
      "I prioritize creating a sense of trust in our relationship.",
      "I put effort into our relationship.",
      "I value my partner's happiness.",
      "I value my partner's feelings.",
      "I want to have a sexually fulfilling relationship with my partner.",
      "I find it difficult to believe what my partner says.",
      "I cannot openly discuss problems with my partner.",
      "I am patient with my partner during our arguments.",
      "The lack of trust in our relationship bothers me.",
      "I always want things to go my way in the relationship.",
      "I wish my partner were less critical.",
      "I am sometimes embarrassed by my partner's behavior.",
      "I feel that my partner takes advantage of my positive feelings towards them.",
      "I am uncomfortable feeling like I am my partner's parent.",
      "My partner's leisure activities negatively impact our relationship.",
      "I feel pressured to participate in activities my partner wants.",
      "My idea of having a good time is different from my partner's, causing problems.",
      "I have doubts about my partner's sexual fidelity.",
      "I do not feel sexually inclined towards my partner.",
      "We disagree about having children.",
      "My partner and I have different ideas about child-rearing.",
      "I believe that differences in our families' parenting styles will cause problems.",
      "We cannot agree on our family budget.",
      "It bothers me that I will have to fully support my partner financially.",
      "I have concerns about our income not being enough after marriage."
    ]
  },
  "CULTURAL_DYNAMICS": {
    "statements": [
      "I openly discuss my religious beliefs with my partner.",
      "I respect my partner's religious beliefs.",
      "I discuss the role of our beliefs in our lives with my partner.",
      "I respect my partner's special religious days.",
      "I discuss how our beliefs will influence our children's lives with my partner.",
      "I am happy to have mutual understanding about religious matters with my partner.",
      "I make an effort to ensure that my family is respectful towards my partner and their family in religious matters.",
      "I am worried that my family does not approve of my partner's beliefs.",
      "Our lifestyles are compatible with each other.",
      "I want to have a similar world view with my partner.",
      "My partner and I have similar political views.",
      "My partner and I have similar personal goals.",
      "Our education levels match.",
      "Our hobbies are similar.",
      "I worry about our differences in opinions.",
      "I respect my partner's clothing style.",
      "I am satisfied with my partner's working conditions.",
      "I am satisfied with the culture my partner's family comes from.",
      "My partner and I have compatible customs and traditions.",
      "I think our families will not have problems during wedding preparations.",
      "I believe that my partner and I are compatible regarding the traditions and customs in the preparations for marriage (engagement, henna night, dowry, etc.).",
      "I think our families are compatible with regard to the traditions and customs in wedding preparations.",
      "I want there to be no problems between my partner and me regarding the gifts we will give each other for the wedding.",
      "I want to come to an agreement with my partner about where we will live after marriage.",
      "I don't think we will have problems with our families regarding where we will live after marriage.",
      "I want to come to an agreement with my partner about the expenses that will arise during wedding preparations.",
      "I believe my partner and I will reach an agreement about the items to be purchased for our home after marriage.",
      "I want to plan our wedding ceremony together with my partner."
    ]
  }
}